<?php

declare(strict_types=1);

return [
    'email' => [
        'title' => 'Изменить адрес электронной почты',
        'updated' => 'Ваш адрес электронной почты обновлён.',
    ],

    'password' => [
        'title' => 'Изменить пароль',
        'requirements' => 'Новый пароль должен содержать не менее 8 символов.',
        'updated' => 'Ваш пароль изменён.',
    ],

    'two_factor' => [
        'button' => 'Настроить двухфакторную аутентификацию',
        'disabled' => 'Двухфакторная аутентификация для вашей учётной записи отключена. Код подтверждения больше не потребуется при входе.',
        'enabled' => 'Двухфакторная аутентификация для вашей учётной записи включена! Теперь при входе потребуется вводить код, сгенерированный вашим устройством.',
        'invalid' => 'Указан неверный код.',

        'setup' => [
            'title' => 'Настройка двухфакторной аутентификации',
            'help' => 'Не удаётся отсканировать код? Введите указанный ниже код в приложение:',
            'field' => 'Введите код подтверждения',
        ],

        'disable' => [
            'title' => 'Отключение двухфакторной аутентификации',
            'field' => 'Введите код подтверждения',
        ],
    ],
];
