<?php

declare(strict_types=1);

return [
    'permissions' => [
        'websocket_*' => 'Разрешает подключение к WebSocket этого сервера.',

        'control_console' => 'Разрешает отправлять данные в консоль сервера.',
        'control_start' => 'Разрешает запускать сервер.',
        'control_stop' => 'Разрешает останавливать сервер.',
        'control_restart' => 'Разрешает перезапускать сервер.',
        'control_kill' => 'Разрешает принудительно завершать процесс сервера.',

        'user_create' => 'Разрешает создавать новые учётные записи пользователей для сервера.',
        'user_read' => 'Разрешает просматривать пользователей, связанных с этим сервером.',
        'user_update' => 'Разрешает изменять других пользователей, связанных с этим сервером.',
        'user_delete' => 'Разрешает удалять других пользователей, связанных с этим сервером.',

        'file_create' => 'Разрешает создавать новые файлы и каталоги.',
        'file_read' => 'Разрешает просматривать файлы и каталоги сервера, а также их содержимое.',
        'file_update' => 'Разрешает изменять файлы и каталоги сервера.',
        'file_delete' => 'Разрешает удалять файлы и каталоги.',
        'file_archive' => 'Разрешает создавать архивы и распаковывать существующие архивы.',
        'file_sftp' => 'Разрешает выполнять перечисленные выше действия с файлами через SFTP-клиент.',

        'allocation_read' => 'Разрешает доступ к страницам управления сетевыми адресами сервера.',
        'allocation_update' => 'Разрешает изменять сетевые адреса сервера.',

        'database_create' => 'Разрешает создавать новые базы данных для сервера.',
        'database_read' => 'Разрешает просматривать базы данных сервера.',
        'database_update' => 'Разрешает изменять базу данных. Для изменения пароля также требуется разрешение «Просмотр пароля».',
        'database_delete' => 'Разрешает удалять базу данных.',
        'database_view_password' => 'Разрешает просматривать пароль базы данных в системе.',

        'schedule_create' => 'Разрешает создавать новые расписания для сервера.',
        'schedule_read' => 'Разрешает просматривать расписания сервера.',
        'schedule_update' => 'Разрешает изменять существующие расписания сервера.',
        'schedule_delete' => 'Разрешает удалять расписания сервера.',
    ],
];
