<?php

declare(strict_types=1);

return [
    'validation' => [
        'fqdn_not_resolvable' => 'Указанное полное доменное имя (FQDN) или IP-адрес не удалось преобразовать в корректный IP-адрес.',
        'fqdn_required_for_ssl' => 'Для использования SSL на этой ноде необходимо полное доменное имя, которое разрешается в публичный IP-адрес.',
    ],

    'notices' => [
        'allocations_added' => 'Сетевые адреса добавлены к ноде.',
        'node_deleted' => 'Нода удалена из панели.',
        'location_required' => 'Перед добавлением ноды необходимо настроить хотя бы одну локацию.',
        'node_created' => 'Новая нода создана. На вкладке «Конфигурация» можно автоматически настроить демон на этой машине. Перед добавлением серверов необходимо назначить ноде хотя бы один IP-адрес и порт.',
        'node_updated' => 'Сведения о ноде обновлены. Если настройки демона изменились, перезапустите его, чтобы изменения вступили в силу.',
        'unallocated_deleted' => 'Удалены все неназначенные порты для <code>:ip</code>.',
    ],
];
