<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Сообщения о сбросе пароля
    |--------------------------------------------------------------------------
    |
    | Сообщения об успешном сбросе пароля и ошибках при его выполнении.
    |
    */

    'password' => 'Пароль должен содержать не менее шести символов и совпадать с подтверждением.',
    'reset' => 'Ваш пароль сброшен!',
    'sent' => 'На вашу электронную почту отправлена ссылка для сброса пароля!',
    'token' => 'Токен сброса пароля недействителен.',
    'user' => 'Пользователь с таким адресом электронной почты не найден.',
];
